mkramar/dizzyrobot/Firmware/Motherboard/simplelink_cc32xx_sdk_1_50_00_06/examples/rtos/CC3220SF_LAUNCHXL/demos/out_of_box/provisioning_task.c
/*
 * Copyright (c) 2016, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

//*****************************************************************************
//
//! \addtogroup out_of_box
//! @{
//
//*****************************************************************************

/* standard includes */
#include <stdlib.h>
#include <string.h>

/* driverlib Header files */
#include <ti/devices/cc32xx/inc/hw_types.h>
#include <ti/devices/cc32xx/inc/hw_memmap.h>
#include <ti/devices/cc32xx/driverlib/rom.h>
#include <ti/devices/cc32xx/driverlib/rom_map.h>
#include <ti/devices/cc32xx/driverlib/prcm.h>
#include <ti/devices/cc32xx/driverlib/timer.h>

/* TI-DRIVERS Header files */
#include <Board.h>
#include <uart_term.h>
#include <ti/drivers/GPIO.h>
#include <ti/drivers/net/wifi/simplelink.h>
#include <ti/drivers/net/wifi/wlan.h>

/* Example/Board Header files */
#include "provisioning_task.h"
#include "platform.h"
#include "out_of_box.h"
#include "link_local_task.h"
#include "ota_archive.h"

/* POSIX Header files */
#include <pthread.h>
#include <time.h>

#define ASYNC_EVT_TIMEOUT               	(5000)  /* In msecs. Used to detect good/bad sl_start() */
#define PROFILE_ASYNC_EVT_TIMEOUT			(5)	/*In sec. Used for connecting to stored profile */
#define LED_TOGGLE_CONFIGURATION_TIMEOUT	(1000)	/* In msecs */
#define LED_TOGGLE_CONFIRMATION_TIMEOUT     (500)   /* In msecs */
#define LED_TOGGLE_CONNECTION_TIMEOUT       (250)   /* In msecs */

#define PROVISIONING_INACTIVITY_TIMEOUT		(600)	/* Provisioning inactivity timeout in seconds */

#define ROLE_SELECTION_BY_SL     			(0xFF)

/*!
 *  \brief  Provisioning modes
 */
typedef enum
{
    PrvsnMode_AP,       /* AP provisioning (AP role) */
    PrvsnMode_SC,       /* Smart Config provisioning (STA role) */
    PrvsnMode_APSC      /* AP + Smart Config provisioning (AP role) */

}PrvsnMode;

/** By default, setting the provisioning mode to AP + Smart Config.
  * Other values could be PrvsnMode_SC or PrvsnMode_AP
  */
#define PROVISIONING_MODE   PrvsnMode_APSC

/*!
 *  \brief  Provisioning status
 */
typedef enum
{
    PrvsnStatus_Stopped,
    PrvsnStatus_InProgress

}PrvsnStatus;

/*
 *  \brief  Application state's context
 */
typedef struct	_Provisioning_AppContext_t_
{
    PrvnState  currentState;       /* Current state of provisioning */
    uint32_t        pendingEvents;      /* Events pending to be processed */

    uint8_t             role;               /* SimpleLink's role - STATION/AP/P2P */

    uint8_t             defaultRole;        /* SimpleLink's default role, try not to change this */
    PrvsnMode     provisioningMode;   /* Provisioning Mode */
    PrvsnStatus   provisioningStatus; /* */

    uint32_t            asyncEvtTimeout;    /* Timeout value*/

    uint32_t        ledToggleTimeout;   /* Timeout value */

}Provisioning_AppContext;

/*!
 *  \brief  Function pointer to the event handler
 */
typedef int32_t (*fptr_EventHandler)(void);

/*!
 *  \brief  Entry in the lookup table
 */
typedef struct
{
    fptr_EventHandler   p_evtHndl;  /* Pointer to the event handler */
    PrvnState          nextState;  /* Next state of provisioning */

}s_TblEntry;

/****************************************************************************
                      LOCAL FUNCTION PROTOTYPES
****************************************************************************/

//*****************************************************************************
//
//! \brief This function initializes provisioning process
//!
//! \param[in]  None
//!
//! \return None
//!
//****************************************************************************
void provisioningInit(void);

//*****************************************************************************
//
//! \brief This function starts provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
int32_t provisioningStart(void);

//*****************************************************************************
//
//! \brief main provisioning loop
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t provisioningAppTask(void);

//*****************************************************************************
//! \brief This function puts the device in its default state. It:
//!           - Set the mode to AP
//!           - Configures connection policy to Auto
//!           - Deletes all the stored profiles
//!           - Enables DHCP
//!		  - Disable IPV6
//!           - Disables Scan policy
//!           - Sets Tx power to maximum
//!           - Sets power policy to normal
//!           - Unregister mDNS services
//!           - Remove all filters
//!
//!           IMPORTANT NOTE - This is an example reset function, user must
//!           update this function to match the application settings.
//!
//! \param   none
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t ConfigureSimpleLinkToDefaultState(void);

//*****************************************************************************
//
//! \brief This function starts the SimpleLink in the configured role. 
//!		 The device notifies the host asynchronously when the initialization is completed
//!
//! \param[in]  role	Device shall be configured in this role
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t InitSimplelink(uint8_t const role);

//*****************************************************************************
//
//! \brief This function handles 'APP_EVENT_STARTED' event
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t HandleStrtdEvt(void);

//*****************************************************************************
//
//! \brief This function starts the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t StartAsyncEvtTimer(uint32_t timeout);

 //*****************************************************************************
//
//! \brief This function stops the async-event timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t StopAsyncEvtTimer(void);

//*****************************************************************************
//
//! \brief internal error detection during provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t ReportError(void);

//*****************************************************************************
//
//! \brief internal report current state during provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t ReportSM(void);

//*****************************************************************************
//
//! \brief steps following a successful provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t ReportSuccess(void);

//*****************************************************************************
//
//! \brief wait for connection following a successful provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t WaitForConn(void);

//*****************************************************************************
//
//! \brief checks for local link connecion to peer device
//!		when set as Station, checks for AP connection
//!		when set as Access Point, no check is required
//!
//! \param[out]  deviceRole		role of the device
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t validateLocalLinkConnection(SlWlanMode_e *deviceRole);

//*****************************************************************************
//
//! Notify if device return to factory image
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void NotifyReturnToFactoryImage(void);

/****************************************************************************
                      GLOBAL VARIABLES
****************************************************************************/
/*!
 *  \brief  Application state's context
 */
Provisioning_AppContext gAppCtx;

timer_t gAsyncEventTimer;
timer_t gLedTimer;

/*!
 *  \brief   Application lookup/transition table
 */
const s_TblEntry gProvisioningTransitionTable[PrvnState_Max][PrvnEvent_Max] =
{
	/* PrvnState_Init */
	{
		/* Event: PrvnEvent_Triggered */
		{provisioningStart      , PrvnState_Idle			            },
        /* Event: PrvnEvent_Started */
        {ReportError         	, PrvnState_Error    					},
		/* Event: PrvnEvent_StartFailed */
        {ReportError         	, PrvnState_Error				    	},
		/* Event: PrvnEvent_ConfirmationSuccess */
        {ReportSM            , PrvnState_Completed                      },		/* special case where confirmation is received after application is restarted and NWP is still in provisioning */
        																		/* in this case, need to move to COMPLETED state */
		/* Event: PrvnEvent_ConfirmationFailed */
        {ReportError            , PrvnState_Error                      },
		/* Event: PrvnEvent_Stopped */
        {ReportSM            , PrvnState_Init		                },		/* in case of auto provisioning */
		/* Event: PrvnEvent_WaitForConn */
		{ReportSM         			, PrvnState_Error                      	},
        /* Event: PrvnEvent_Timeout */
        {ReportError            , PrvnState_Error		               	},
        /* Event: PrvnEvent_Error */
        {ReportError       		, PrvnState_Error                    	},
    },
    /* PrvnState_Idle */
    {
		/* Event: PrvnEvent_Triggered */
		{ReportError      , PrvnState_Error			            },
        /* Event: PrvnEvent_Started */
        {HandleStrtdEvt         , PrvnState_WaitForConfirmation    	},
		/* Event: PrvnEvent_StartFailed */
        {ReportError         	, PrvnState_Error				    	},
		/* Event: PrvnEvent_ConfirmationSuccess */
        {ReportError            , PrvnState_Error                      },
		/* Event: PrvnEvent_ConfirmationFailed */
        {ReportError            , PrvnState_Error                      },
		/* Event: PrvnEvent_Stopped */
        {ReportSM            	, PrvnState_Init                      	},
		/* Event: PrvnEvent_WaitForConn */
		{ReportSM         			, PrvnState_Error                      	},
        /* Event: PrvnEvent_Timeout */
        {ReportError            , PrvnState_Error		               	},
        /* Event: PrvnEvent_Error */
        {ReportError       		, PrvnState_Error                    	},
    },
	/* PrvnState_WaitForConfirmation */
	{
		/* Event: PrvnEvent_Triggered */
		{ReportError      , PrvnState_Error			            },
		/* Event: PrvnEvent_Started */
		{ReportError         	, PrvnState_Error    					},
		/* Event: PrvnEvent_StartFailed */
		{ReportSM         	, PrvnState_Idle				    	},
		/* Event: PrvnEvent_ConfirmationSuccess */
		{ReportSM            	, PrvnState_Completed                  },
		/* Event: PrvnEvent_ConfirmationFailed */
		{ReportSM            	, PrvnState_WaitForConfirmation     },
		/* Event: PrvnEvent_Stopped */
		{ReportSM            	, PrvnState_Init                       },
		/* Event: PrvnEvent_WaitForConn */
		{ReportSM         			, PrvnState_Error                      	},
		/* Event: PrvnEvent_Timeout */
		{ReportError            , PrvnState_Error		               	},
		/* Event: PrvnEvent_Error */
		{ReportError       		, PrvnState_Error                    	},
	},
	/* PrvnState_Completed */
	{
		/* Event: PrvnEvent_Triggered */
		{ReportError      , PrvnState_Error			            },
		/* Event: PrvnEvent_Started */
		{ReportError         	, PrvnState_Error    					},
		/* Event: PrvnEvent_StartFailed */
		{ReportError         	, PrvnState_Error				    	},
		/* Event: PrvnEvent_ConfirmationSuccess */
		{ReportError            , PrvnState_Error                  	},
		/* Event: PrvnEvent_ConfirmationFailed */
		{ReportError            , PrvnState_Error					    },
		/* Event: PrvnEvent_Stopped */
		{ReportSuccess         	, PrvnState_Init                      	},
		/* Event: PrvnEvent_WaitForConn */
		{WaitForConn         	, PrvnState_Init                      	},	/* this state should cover cases where feedback failed but profile exists */
		/* Event: PrvnEvent_Timeout */
		{ReportError            , PrvnState_Error		               	},
		/* Event: PrvnEvent_Error */
		{ReportError       		, PrvnState_Error                    	},
	},
	/* PrvnState_Error */
	{
		/* Event: PrvnEvent_Triggered */
		{ReportError      , PrvnState_Error			            },
		/* Event: PrvnEvent_Started */
		{ReportError         	  , PrvnState_Error    				},
		/* Event: PrvnEvent_StartFailed */
		{ReportError         	  , PrvnState_Error				   	},
		/* Event: PrvnEvent_ConfirmationSuccess */
		{ReportError              , PrvnState_Error                  	},
		/* Event: PrvnEvent_ConfirmationFailed */
		{ReportError              , PrvnState_Error				    },
		/* Event: PrvnEvent_Stopped */
		{ReportError              , PrvnState_Error                   	},
		/* Event: PrvnEvent_WaitForConn */
		{ReportSM         			, PrvnState_Error                      	},
		/* Event: PrvnEvent_Timeout */
		{ReportError              , PrvnState_Error		           	},
		/* Event: PrvnEvent_Error */
		{ReportError       		  , PrvnState_Error                  	},
	}
};

Provisioning_CB	Provisioning_ControlBlock;

/*****************************************************************************
                  Callback Functions
*****************************************************************************/

//*****************************************************************************
//
//! \brief The device init callback
//!
//! \param[in]  status	Mode the device is configured in
//!
//! \return None
//!
//****************************************************************************
void SimpleLinkInitCallback(uint32_t status, SlDeviceInitInfo_t *DeviceInitInfo)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;

    UART_PRINT("[Provisioning task] Device started in %s role\n\r", (0 == status) ? "Station" :\
                                               ((2 == status) ? "AP" : "P2P"));

    /** While provisioning is ongoing, the appropriate role is choosen by the
      * device itself, and host can remain agnostic to these details
      */
    if(pCtx->role == ROLE_SELECTION_BY_SL)
    {
        SignalProvisioningEvent(PrvnEvent_Started);
    }
    else
    {
        /* Either trigger an error/started event here */
        if(pCtx->role == status)
        {
            SignalProvisioningEvent(PrvnEvent_Started);
        }
        else
        {
            UART_PRINT("[Provisioning task] But the intended role is %s \n\r",\
                                        (0 == pCtx->role) ? "Station" :\
                                        ((2 == pCtx->role) ? "AP" : "P2P"));
            SignalProvisioningEvent(PrvnEvent_Error);
        }
    }
}

//*****************************************************************************
//
//! \brief The interrupt handler for the async-evt timer
//!
//! \param[in]  None
//!
//! \return None
//!
//****************************************************************************
void AsyncEvtTimerIntHandler(sigval val)
{
	/* Clear the timer interrupt. */
	Platform_TimerInterruptClear();

    /* One Shot */
    /* TBD - Check role for One-shot/periodic */
    StopAsyncEvtTimer();
    SignalProvisioningEvent(PrvnEvent_Timeout);
}

//*****************************************************************************
//
//! \brief The interrupt handler for the LED timer
//!
//! \param[in]  None
//!
//! \return None
//!
//****************************************************************************
void LedTimerIntHandler(sigval val)
{
	/* Clear the timer interrupt. */
	Platform_TimerInterruptClear();

