mkramar/dizzyrobot/Firmware/Motherboard/simplelink_cc32xx_sdk_1_50_00_06/examples/rtos/CC3220SF_LAUNCHXL/demos/out_of_box/provisioning_task.c
	GPIO_toggle(Board_LED0);
}

//*****************************************************************************
//                 Local Functions
//*****************************************************************************

//*****************************************************************************
//
//! \brief This function initializes provisioning process
//!
//! \param[in]  None
//!
//! \return None
//!
//****************************************************************************
void provisioningInit(void)
{
	Provisioning_AppContext *const pCtx = &gAppCtx;

	Platform_TimerInit(AsyncEvtTimerIntHandler, &gAsyncEventTimer);

    /** By default, setting the provisioning mode to AP + Smart Config.
	  * Other values could be PrvsnMode_SC or PrvsnMode_AP
	  */
	pCtx->provisioningMode = PROVISIONING_MODE;
	switch(pCtx->provisioningMode)
	{
		case PrvsnMode_APSC: pCtx->defaultRole = ROLE_AP;
		break;

		case PrvsnMode_AP: pCtx->defaultRole = ROLE_AP;
		break;

		case PrvsnMode_SC: pCtx->defaultRole = ROLE_STA;
		break;
	}

	/* Provisioning has not started yet */
	pCtx->provisioningStatus = PrvsnStatus_Stopped;
	pCtx->currentState = PrvnState_Init;

}

//*****************************************************************************
//
//! \brief This function starts provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
int32_t provisioningStart(void)
{
	int32_t		retVal = 0;
	Provisioning_AppContext *const pCtx = &gAppCtx;
	SlDeviceVersion_t ver = {0};
	uint8_t  configOpt = 0;
	uint16_t configLen = 0;

	/* check if provisioning is running */
	/* if auto provisioning - the command stops it automatically */
	/* in case host triggered provisioning - need to stop it explicitly */
	configOpt = SL_DEVICE_GENERAL_VERSION;
	configLen = sizeof(ver);
	retVal = sl_DeviceGet(SL_DEVICE_GENERAL, &configOpt, &configLen, (uint8_t *)(&ver));
	if(SL_RET_CODE_PROVISIONING_IN_PROGRESS == retVal)
	{
		UART_PRINT("[Provisioning task] Provisioning is already running, stopping it...\r\n");
		retVal = sl_WlanProvisioning(SL_WLAN_PROVISIONING_CMD_STOP,ROLE_STA,0,NULL,0);

		/* return  SL_RET_CODE_PROVISIONING_IN_PROGRESS to indicate the SM to stay in the same state*/
		return SL_RET_CODE_PROVISIONING_IN_PROGRESS;
	}

    /*
        IMPORTANT NOTE - This is an example reset function, user must update
                         this function to match the application settings.
    */    
    retVal = ConfigureSimpleLinkToDefaultState();

    if(retVal < 0)
    {
        UART_PRINT("[Provisioning task] Failed to configure the device in its default state \n\r");
        return retVal;
    }

    UART_PRINT("[Provisioning task] Device is configured in default state \n\r");

	/* Provisioning has not started yet */
	pCtx->provisioningStatus = PrvsnStatus_Stopped;

	/* Set the LED toggling timeout before starting the timer */
	pCtx->ledToggleTimeout = LED_TOGGLE_CONFIGURATION_TIMEOUT;
	StartLedEvtTimer(pCtx->ledToggleTimeout);

	retVal = InitSimplelink(pCtx->defaultRole);
	if(retVal < 0)
	{
		UART_PRINT("[Provisioning task] Failed to initialize the device\n\r");
		return retVal;
	}

	return retVal;
}

//*****************************************************************************
//
//! \brief main provisioning loop
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t provisioningAppTask(void)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;
    s_TblEntry   *pEntry = NULL;
    uint16_t eventIdx = 0;
    int32_t	retVal = 0;

    for(eventIdx = 0; eventIdx < PrvnEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx)))
        {
            if (eventIdx != PrvnEvent_Triggered)
            {
                /** Events received - Stop the respective timer if its still
                  * running
                  */
                StopAsyncEvtTimer();

            }

            pEntry = (s_TblEntry *)&gProvisioningTransitionTable[pCtx->currentState][eventIdx];
            if (NULL != pEntry->p_evtHndl)
            {
                retVal = pEntry->p_evtHndl();
                if (retVal == SL_RET_CODE_PROVISIONING_IN_PROGRESS)		/* no state transition is required */
                {
                	pCtx->pendingEvents &= ~(1 << eventIdx);
                	continue;
                }
                else if (retVal < 0)
                {
                    UART_PRINT("[Provisioning task] Event handler failed, error=%d\n\r", retVal);
                    while (1)		/* this is to let other tasks recover by mcu reset, e.g. in case of switching to AP mode */
                    	{
                    		usleep(1000);
                    	}
                }
            }

            if (pEntry->nextState != pCtx->currentState)
            {
                pCtx->currentState = pEntry->nextState;
            }

            pCtx->pendingEvents &= ~(1 << eventIdx);
        }

        /* No more events to handle. Break.! */
        if(0 == pCtx->pendingEvents) 
	{
		break;
        }
    }

    usleep(1000);

    return 0;
}



//*****************************************************************************
//! \brief This function puts the device in its default state. It:
//!           - Set the mode to AP
//!           - Configures connection policy to Auto
//!           - Deletes all the stored profiles
//!           - Enables DHCP
//!		  - Disable IPV6
//!           - Disables Scan policy
//!           - Sets Tx power to maximum
//!           - Sets power policy to normal
//!           - Unregister mDNS services
//!           - Remove all filters
//!
//!           IMPORTANT NOTE - This is an example reset function, user must
//!           update this function to match the application settings.
//!
//! \param   none
//! \return  On success, zero is returned. On error, negative is returned
//*****************************************************************************
static int32_t ConfigureSimpleLinkToDefaultState(void)
{
    SlWlanRxFilterOperationCommandBuff_t  RxFilterIdMask;

    uint8_t 	ucConfigOpt = 0;
    uint16_t 	ifBitmap  = 0;
    uint8_t 	ucPower = 0;

    int32_t 			ret = -1;
    int32_t 			mode = -1;

    memset(&RxFilterIdMask,0,sizeof(SlWlanRxFilterOperationCommandBuff_t));

