mkramar/dizzyrobot/Firmware/Motherboard/simplelink_cc32xx_sdk_1_50_00_06/examples/rtos/CC3220SF_LAUNCHXL/demos/out_of_box/provisioning_task.c
    return 0;
}


//*****************************************************************************
//
//! \brief internal error detection during provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t ReportError(void)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < PrvnEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx))) 
	{
		break;
        }
    }

    UART_PRINT("[Provisioning task] Unexpected SM: State = %d, Event = %d\n\r",\
                                    pCtx->currentState, eventIdx);
    return -1; 
}

//*****************************************************************************
//
//! \brief internal report current state during provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t ReportSM(void)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;
    uint16_t eventIdx = 0;

    for(eventIdx = 0; eventIdx < PrvnEvent_Max; eventIdx++)
    {
        if(0 != (pCtx->pendingEvents & (1 << eventIdx))) 
	{
		break;
        }
    }

    if (PrvnEvent_Stopped == eventIdx)
    {
    	StopLedEvtTimer();
    	GPIO_write(Board_LED0, Board_LED_OFF);
    }

    return 0;
}

//*****************************************************************************
//
//! \brief steps following a successful provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t ReportSuccess(void)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;
    uint16_t ConfigOpt;
	uint16_t ipLen;
	SlNetCfgIpV4Args_t ipV4 = {0};
    int32_t retVal;

    UART_PRINT("[Provisioning task] Provisioning completed successfully..!\n\r");
    pCtx->provisioningStatus = PrvsnStatus_Stopped;
    StopLedEvtTimer();

    /* Get the device's IP address */
	ipLen = sizeof(SlNetCfgIpV4Args_t);
	ConfigOpt = 0;
	retVal = sl_NetCfgGet(SL_NETCFG_IPV4_STA_ADDR_MODE,&ConfigOpt,&ipLen,(uint8_t *)&ipV4);
	if (retVal == 0)
	{
		UART_PRINT("[Provisioning task] IP address is %d.%d.%d.%d\n\r",\
					SL_IPV4_BYTE(ipV4.Ip,3),  \
					SL_IPV4_BYTE(ipV4.Ip,2),  \
					SL_IPV4_BYTE(ipV4.Ip,1),  \
					SL_IPV4_BYTE(ipV4.Ip,0));
	}

	GPIO_write(Board_LED0, Board_LED_ON);

	/* signal to linklocal task */
	sem_post(&Provisioning_ControlBlock.provisioningDoneSignal);

	/* signal to report server task */
	sem_post(&Provisioning_ControlBlock.provisioningConnDoneToOtaServerSignal);

    return 0;
}


//*****************************************************************************
//
//! \brief wait for connection following a successful provisioning process
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t WaitForConn(void)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;
    struct timespec ts;
    int32_t retVal;

    while (((!IS_IPV6L_ACQUIRED(OutOfBox_ControlBlock.status) ||
			!IS_IPV6G_ACQUIRED(OutOfBox_ControlBlock.status)) &&
			!IS_IP_ACQUIRED(OutOfBox_ControlBlock.status)) ||
			!IS_CONNECTED(OutOfBox_ControlBlock.status))
	{
		clock_gettime(CLOCK_REALTIME, &ts);
		ts.tv_sec += PROFILE_ASYNC_EVT_TIMEOUT;

		retVal = sem_timedwait(&Provisioning_ControlBlock.connectionAsyncEvent, &ts);
		if((retVal == 116) || (retVal == -1))	/* freertos return -1 in case of timeout */
		{
			UART_PRINT("[Provisioning task] Cannot connect to AP or profile does not exist\n\r");
			GPIO_write(Board_LED0, Board_LED_OFF);
			pCtx->currentState = PrvnState_Init;	/* this state is set so that PrvnEvent_Triggered would invoke provisioning again */
			SignalProvisioningEvent(PrvnEvent_Triggered);

			return 0;
		}
	}

	UART_PRINT("[Provisioning task] Connection to AP succeeded\n\r");

	return ReportSuccess();
}


//*****************************************************************************
//
//! \brief checks for local link connecion to peer device
//!		when set as Station, checks for AP connection
//!		when set as Access Point, no check is required
//!
//! \param[out]  deviceRole		role of the device
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
static int32_t validateLocalLinkConnection(SlWlanMode_e *deviceRole)
{
	uint16_t ConfigOpt;
	uint16_t ipLen;
	SlNetCfgIpV4Args_t ipV4 = {0};
	int32_t retVal;
	uint32_t ocpRegVal;

	struct timespec ts;

	retVal = sl_Start(0, 0, 0);
	if (SL_ERROR_CALIB_FAIL == retVal)	/* when calibration fails, reboot is required */
	{
		mcuReboot();
	}
	else
	{
		ASSERT_ON_ERROR(retVal);
	}

	/* if in AP role
	 * 1) check OCP register value
	 * 2) if set, it means user set AP mode via switch.
	 *  	 check for IP_ACQUIRED to indicate NWP is running
	 * 4) if not set, procede with STATION role
	 */
	if (retVal == ROLE_AP)
	{
		*deviceRole = ROLE_AP;
		ocpRegVal = MAP_PRCMOCRRegisterRead(OCP_REGISTER_INDEX);
		ocpRegVal &= (1<<OCP_REGISTER_OFFSET);
		if (ocpRegVal)
		{
			if (IS_IP_ACQUIRED(OutOfBox_ControlBlock.status))
			{
				return 0;
			}
			else
			{
				clock_gettime(CLOCK_REALTIME, &ts);
       			ts.tv_sec += PROFILE_ASYNC_EVT_TIMEOUT;
				
				retVal = sem_timedwait(&Provisioning_ControlBlock.connectionAsyncEvent, &ts);
				if((retVal == 116) || (retVal == -1))	/* freertos return -1 in case of timeout */
				{
					UART_PRINT("[Provisioning task] AP role failed to initialize\n\r");
					GPIO_write(Board_LED0, Board_LED_OFF);
					retVal = -1;
				}
				return retVal;
			}
		}
	}

	if(retVal != ROLE_STA)
	{
		retVal = sl_WlanSetMode(ROLE_STA);
		ASSERT_ON_ERROR(retVal);

		retVal = sl_Stop(SL_STOP_TIMEOUT );
		ASSERT_ON_ERROR(retVal);

		retVal = sl_Start(0, 0, 0);
		if (retVal < 0 || (retVal != ROLE_STA))
		{
			ASSERT_ON_ERROR(retVal);
		}
		UART_PRINT("[Provisioning task] Device started as STATION \n\r");
	}

	*deviceRole = ROLE_STA;

	while (((!IS_IPV6L_ACQUIRED(OutOfBox_ControlBlock.status) ||
			!IS_IPV6G_ACQUIRED(OutOfBox_ControlBlock.status)) &&
			!IS_IP_ACQUIRED(OutOfBox_ControlBlock.status)) ||
			!IS_CONNECTED(OutOfBox_ControlBlock.status))
	{
		clock_gettime(CLOCK_REALTIME, &ts);
       	ts.tv_sec += PROFILE_ASYNC_EVT_TIMEOUT;
				
