mkramar/dizzyrobot/Firmware/Motherboard/simplelink_cc32xx_sdk_1_50_00_06/examples/rtos/CC3220SF_LAUNCHXL/demos/out_of_box/provisioning_task.c
		retVal = sem_timedwait(&Provisioning_ControlBlock.connectionAsyncEvent, &ts);
		if((retVal == 116) || (retVal == -1))	/* freertos return -1 in case of timeout */
		{
			UART_PRINT("[Provisioning task] Cannot connect to AP or profile does not exist\n\r");
			GPIO_write(Board_LED0, Board_LED_OFF);
			retVal = -1;

			return retVal;
		}
	}

	UART_PRINT("[Provisioning task] Connection to AP succeeded\n\r");

	/* Get the device's IP address */
	ipLen = sizeof(SlNetCfgIpV4Args_t);
	ConfigOpt = 0;
	sl_NetCfgGet(SL_NETCFG_IPV4_STA_ADDR_MODE,&ConfigOpt,&ipLen,(uint8_t *)&ipV4);
	if (retVal < 0)
	{
		return retVal;
	}

	UART_PRINT("[Provisioning task] IP address is %d.%d.%d.%d\n\r",\
			SL_IPV4_BYTE(ipV4.Ip,3),  \
			SL_IPV4_BYTE(ipV4.Ip,2),  \
			SL_IPV4_BYTE(ipV4.Ip,1),  \
			SL_IPV4_BYTE(ipV4.Ip,0));

    return 0;
}

//*****************************************************************************
//
//! Notify if device return to factory image
//!
//! \param  None
//!
//! \return None
//
//*****************************************************************************
static void NotifyReturnToFactoryImage(void)
{
    if(((HWREG(HIB3P3_BASE + 0x00000418) & (1<<7)) !=0) &&
        ((HWREG(0x4402F0C8) &0x01) != 0))
    {
        UART_PRINT("Return To Factory Image successful, Do a power cycle(POR)"
                    " of the device using switch SW1-Reset\n\r");
        while(1);
    }
}


//****************************************************************************
//                            MAIN FUNCTION
//****************************************************************************

//*****************************************************************************
//
//! \brief This function signals the application events
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
int16_t SignalProvisioningEvent(PrvnEvent event)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;
    pCtx->pendingEvents |= (1 << event);

    return 0;
}

//*****************************************************************************
//
//! \brief This function gets the current provisioning state
//!
//! \param[in]  None
//!
//! \return provisioning state
//!
//****************************************************************************
PrvnState GetProvisioningState()
{
	Provisioning_AppContext *const pCtx = &gAppCtx;

	return pCtx->currentState;
}


//*****************************************************************************
//
//! \brief This function starts the led toggling timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
int32_t StartLedEvtTimer(uint32_t timeout)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;

    pCtx->ledToggleTimeout = timeout;
	Platform_TimerStart(pCtx->ledToggleTimeout, gLedTimer, 1);
	
    return 0;
}

//*****************************************************************************
//
//! \brief This function stops the led toggling timer
//!
//! \param[in]  None
//!
//! \return 0 on success, negative value otherwise
//!
//****************************************************************************
int32_t StopLedEvtTimer(void)
{
    Provisioning_AppContext *const pCtx = &gAppCtx;

	if(0 != pCtx->ledToggleTimeout)
    {
        Platform_TimerStop(gLedTimer);
        pCtx->ledToggleTimeout = 0;
    }

    return 0;
}


//*****************************************************************************
//
//! \brief This function stops provisioning process
//!
//! \param[in]  None
//!
//! \return SL_RET_CODE_PROVISIONING_IN_PROGRESS if provisioning was running, otherwise 0
//!
//****************************************************************************
int32_t provisioningStop(void)
{
	Provisioning_AppContext *const pCtx = &gAppCtx;
	int32_t						retVal;
	PrvnState 				provisioningState;
	SlDeviceVersion_t ver = {0};
	uint8_t  configOpt = 0;
	uint16_t configLen = 0;
	
	/* check if provisioning is running */
	configOpt = SL_DEVICE_GENERAL_VERSION;
	configLen = sizeof(ver);
	retVal = sl_DeviceGet(SL_DEVICE_GENERAL, &configOpt, &configLen, (uint8_t *)(&ver));
	if(SL_RET_CODE_PROVISIONING_IN_PROGRESS == retVal)
	{
		UART_PRINT("[Provisioning task]  Provisioning is already running, stopping it...\r\n");
		retVal = sl_WlanProvisioning(SL_WLAN_PROVISIONING_CMD_STOP,ROLE_STA,0,NULL,0);

		/* wait for the stopped event to arrive - wait for PrvnState_Init */
		do
		{
			provisioningState = GetProvisioningState();
			usleep(1000);
		} while (provisioningState != PrvnState_Init);

		pCtx->provisioningStatus = PrvsnStatus_Stopped;

		retVal = SL_RET_CODE_PROVISIONING_IN_PROGRESS;
	}
	else if (retVal < 0)
	{
		return retVal;
	}
	else
	{
		retVal = 0;
	}

	return retVal;
}



//*****************************************************************************
//
//! \brief This is the main provisioning task
//!
//! \param[in]  None
//!
//! \return None
//!
//****************************************************************************
void * provisioningTask(void *pvParameters)
{
	int32_t			retVal = -1;
	Provisioning_AppContext 	*const pCtx = &gAppCtx;
	SlWlanMode_e 	deviceRole;
	SlFsControl_t 	FsControl;
    int32_t 			status;
	
	/* Check the wakeup source. If first time entry or wakeup from HIB */
	if(MAP_PRCMSysResetCauseGet() == 0)
	{
		UART_PRINT("[Provisioning task] Wake up on Power ON\n\r");
	}
	else if(MAP_PRCMSysResetCauseGet() == PRCM_HIB_EXIT)
	{
		UART_PRINT("[Provisioning task] Woken up from Hibernate\n\r");
	}



    /*
     	Following function first try to connect to a stored profile.
	 If fails, it first configure the device to default state by cleaning
     	the persistent settings stored in NVMEM (viz. connection profiles &
     	policies, power policy etc)
    	
     	Applications may choose to skip this step if the developer is sure
     	that the device is in its desired state at start of applicaton
    	
     	Note that all profiles and persistent settings that were done on the
     	device will be lost	*/
    
    
	/* initialize one-time parameters for provisioning */
	provisioningInit();

