mkramar/dizzyrobot/Firmware/Motherboard/simplelink_cc32xx_sdk_1_50_00_06/examples/rtos/CC3220SF_LAUNCHXL/demos/out_of_box/provisioning_task.c
    /* Configure Provisioning Toggle LED  */
	GPIO_write(Board_LED0, Board_LED_OFF);

	Platform_TimerInit(LedTimerIntHandler, &gLedTimer);

	/* Set the LED toggling timeout before starting the timer */
	pCtx->ledToggleTimeout = LED_TOGGLE_CONFIRMATION_TIMEOUT;

	StartLedEvtTimer(pCtx->ledToggleTimeout);
	
	/* check whether return-to-default occured */
	NotifyReturnToFactoryImage();

	/* 1) try to connect to a stored profile if in STATION mode
	 * 2) if successful, procede and validate ota bundle and then try to connect to cloud
	 * 3) if unsuccessful when in STATION mode, procede to provisioning
	 * 4) if in AP mode, procede and validate ota bundle
	 */
	retVal = validateLocalLinkConnection(&deviceRole);
	getDeviceType();
	/* at this point, provisioning has not started yet, unless auto provisioning is running */
	/* in this case, if provisioning from mobile app is running, it would not be possible to send most of the commands to the device */
	/* need to stop provisioning */
	provisioningStop();

	StopLedEvtTimer();

	/* 1) in case coming from ota procedure, a profile should reside on serial flash and connect immediately
	 * 2) check if pending commit and set commit the bundle
	 * 3) On failure, reset the MCU to rollback */
	 
	if (OtaArchive_GetPendingCommit())	/* it means OtaArchive is in SL_FS_BUNDLE_STATE_PENDING_COMMIT */
	{
		if (retVal != 0)	/* validation of new ota bundle failed, reverting to previous bundle */
		{
			/* rollback is not required for production devices - but it is not harmfull */
			FsControl.IncludeFilters = 0;
		    	status = sl_FsCtl(SL_FS_CTL_BUNDLE_ROLLBACK, 0, NULL ,(uint8_t *)&FsControl, sizeof(SlFsControl_t), NULL, 0 , NULL);
		    	if( status < 0 )
		    	{
		        	UART_PRINT("[Provisioning task] Rollback error sl_FsCtl, status=%d\n\r", status);
		    	}
				
			mcuReboot();
		}
		else	/* validation of new ota bundle succeeded, commit the new ota bundle */
		{
			UART_PRINT("[Provisioning task] committing new ota download... \n\r");
			if (OtaArchive_Commit() < 0)
			{
				UART_PRINT("[Provisioning task] failed to commit new download, reverting to previous copy by reseting the device \n\r");
				mcuReboot();
			}
			UART_PRINT("[Provisioning task] commit succeeded \n\r");
			
			/* need to stop the WDT so MCU is not reset */
			PRCMPeripheralReset(PRCM_WDT);
		}
	}

	if (deviceRole == ROLE_STA)		
	{
		/* it means a connection to AP has been established, no need to trigger provisioning */
		if (retVal == 0)
		{
			GPIO_write(Board_LED0, Board_LED_ON);

			/* signal to linklocal task */
			sem_post(&Provisioning_ControlBlock.provisioningDoneSignal);

			/* signal to report server task */
			sem_post(&Provisioning_ControlBlock.provisioningConnDoneToOtaServerSignal);
		}
		/* it means a connection to AP failed, trigger provisioning */
		else if (retVal < 0)
		{
			SignalProvisioningEvent(PrvnEvent_Triggered);
		}
	}

	if ((retVal == 0) && (deviceRole == ROLE_AP))		/* it means device is initialized as AP, no need to trigger provisioning */
	{
		GPIO_write(Board_LED0, Board_LED_ON);
		
		/* signal to linklocal task */
		sem_post(&Provisioning_ControlBlock.provisioningDoneSignal);

		/* signal to report server task */
		sem_post(&Provisioning_ControlBlock.provisioningConnDoneToOtaServerSignal);
	}

    do
	{
        retVal = provisioningAppTask();

    }while(!retVal); /* Exit on failure */

	return(0);
}
//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
